{
  "entries": [
    {
      "id": 1,
      "date": "12-19-2022",
      "topic": "React",
      "rating": 8,
      "achievement": "Work through react forms and start state for my react form.  Website design",
      "struggle": "remembering how to add certain aspects of event handlers",
      "journal": "Today I experimented with the use of chatGPT to help me write code for my application to track my productivity.  I had a few distractions, but they were minimal today.  Overall my focus is not as I would like it to be.  I need to train and push through this.  Remember the pain of the job interview and continue to push",
      "plan": "Set up mockAPI for my data and have my data populate on create new post.  Sort by date."
    },
    {
      "date": "2022-12-22T13:03:45.184Z",
      "topic": "Context Provider",
      "rating": 8,
      "achievement": "Finished allowing Edit and delete.  Page updates correctly.  ",
      "struggle": "I was missing await on the API call and edit was not re-rendering properly because it was pushing a blank object into current state vs grabbing the proper fetch. ",
      "journal": "The code was somewhat difficult to write for this project.  I used a lot of state observation to trouble shoot, realizing that my state was firing correctly through the component but I was not rendering what I wanted successfully.  It took a lot of inspection, but I eventually discovered my missing word that caused my app to work successfully.  First time I have also implemented a mock back end with JSON server.  It helped to realize the server was patching correctly in discovering my mistake.  ",
      "plan": "Set up and learn react Query.  I need to add error and loading handlers. ",
      "id": 3
    },
    {
      "date": "2022-12-22T14:11:50.847Z",
      "topic": "React",
      "rating": 8,
      "achievement": "",
      "struggle": "",
      "journal": "",
      "plan": "plan",
      "id": 4
    },
    {
      "date": "2022-12-22T14:12:01.176Z",
      "topic": "React",
      "rating": 8,
      "achievement": "",
      "struggle": "",
      "journal": "",
      "plan": "",
      "id": 5
    }
  ]
}