{
  "entries": [
    {
      "id": 1,
      "date": "12-19-2022",
      "topic": "React",
      "rating": 8,
      "achievement": "Work through react forms and start state for my react form.  Website design",
      "struggle": "remembering how to add certain aspects of event handlers",
      "journal": "Today I experimented with the use of chatGPT to help me write code for my application to track my productivity.  I had a few distractions, but they were minimal today.  Overall my focus is not as I would like it to be.  I need to train and push through this.  Remember the pain of the job interview and continue to push",
      "plan": "Set up mockAPI for my data and have my data populate on create new post.  Sort by date."
    },
    {
      "date": "2022-12-22T13:03:45.184Z",
      "topic": "Context Provider",
      "rating": 8,
      "achievement": "Finished allowing Edit and delete.  Page updates correctly.  ",
      "struggle": "I was missing await on the API call and edit was not re-rendering properly because it was pushing a blank object into current state vs grabbing the proper fetch. ",
      "journal": "The code was somewhat difficult to write for this project.  I used a lot of state observation to trouble shoot, realizing that my state was firing correctly through the component but I was not rendering what I wanted successfully.  It took a lot of inspection, but I eventually discovered my missing word that caused my app to work successfully.  First time I have also implemented a mock back end with JSON server.  It helped to realize the server was patching correctly in discovering my mistake.  ",
      "plan": "Set up and learn react Query.  I need to add error and loading handlers. ",
      "id": 3
    },
    {
      "date": "2022-12-26T12:57:35.782Z",
      "topic": "React Query",
      "rating": 6,
      "achievement": "React query and axios successfully on fetched initial data",
      "struggle": "many errors along the way.  Difficulty with map function through prop drilling.  Axios and Query not initiall working.",
      "journal": "React query must take an array as a key [\"key], function(fetch) to get the function.  React query will attempt to fire off 3 times.  I was running into difficulty with it pushing the data as undefined because it hadn't finished fetching the data.  I'm still processing and working through this.  There are other features of useQuery I need to learn to make this a smooth transition and also to drill down error and loading handlers.",
      "plan": "Work on error and loading handlers for this app.  Get all the data management switched over to react query.  Figure out how to get the queried data to other componenets without making multiple requests.  Watch more react-query tutorials and read the docs. ",
      "id": 4
    },
    {
      "date": "2022-12-26T20:34:33.127Z",
      "topic": "React Query",
      "rating": 7,
      "achievement": "None",
      "struggle": "The whole entire morning was a struggle.  I spent 5 hours pouring over react query.  I could not figure out how to get the mutation to recall properly.  There was issues with axios, and I wasn't quite able to understand how to send my data points to my entriesAPI and back to my state.  This is probably a major flaw in my state management that is preventing me from writing accordingly.",
      "journal": "I also attempted to use Typescript but it was very difficult on where to begin in an application so embedded without typing.  I may have to start over writing this app using typescript, and refactoring.  It is of my best interest to possibly read react documents at the moment and learn how to restructure my application. ",
      "plan": "Read react documents.  Also just noted a bug in my form that my rating is being reset if I type in any other box.  I'll have to rethink how I write my handleChange event handler. ",
      "id": 5
    }
  ]
}